{"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "kernel_dim3": 3, "init": "glorot_uniform", "kernel_dim1": 3, "batch_input_shape": [null, 3, 16, 112, 112], "nb_filter": 64, "name": "conv1", "activation": "relu", "W_constraint": null, "kernel_dim2": 3, "activity_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "bias": true, "dim_ordering": "th", "subsample": [1, 1, 1]}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "strides": [1, 2, 2], "border_mode": "valid", "pool_size": [1, 2, 2], "name": "pool1", "dim_ordering": "th"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "kernel_dim2": 3, "kernel_dim1": 3, "nb_filter": 128, "activation": "relu", "kernel_dim3": 3, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample": [1, 1, 1], "dim_ordering": "th", "name": "conv2"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "strides": [2, 2, 2], "border_mode": "valid", "pool_size": [2, 2, 2], "name": "pool2", "dim_ordering": "th"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "kernel_dim2": 3, "kernel_dim1": 3, "nb_filter": 256, "activation": "relu", "kernel_dim3": 3, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample": [1, 1, 1], "dim_ordering": "th", "name": "conv3a"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "kernel_dim2": 3, "kernel_dim1": 3, "nb_filter": 256, "activation": "relu", "kernel_dim3": 3, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample": [1, 1, 1], "dim_ordering": "th", "name": "conv3b"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "strides": [2, 2, 2], "border_mode": "valid", "pool_size": [2, 2, 2], "name": "pool3", "dim_ordering": "th"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "kernel_dim2": 3, "kernel_dim1": 3, "nb_filter": 512, "activation": "relu", "kernel_dim3": 3, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample": [1, 1, 1], "dim_ordering": "th", "name": "conv4a"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "kernel_dim2": 3, "kernel_dim1": 3, "nb_filter": 512, "activation": "relu", "kernel_dim3": 3, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample": [1, 1, 1], "dim_ordering": "th", "name": "conv4b"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "strides": [2, 2, 2], "border_mode": "valid", "pool_size": [2, 2, 2], "name": "pool4", "dim_ordering": "th"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "kernel_dim2": 3, "kernel_dim1": 3, "nb_filter": 512, "activation": "relu", "kernel_dim3": 3, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample": [1, 1, 1], "dim_ordering": "th", "name": "conv5a"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "kernel_dim2": 3, "kernel_dim1": 3, "nb_filter": 512, "activation": "relu", "kernel_dim3": 3, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample": [1, 1, 1], "dim_ordering": "th", "name": "conv5b"}}, {"class_name": "ZeroPadding3D", "config": {"trainable": true, "padding": [0, 1, 1], "name": "zeropadding3d_1"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "strides": [2, 2, 2], "border_mode": "valid", "pool_size": [2, 2, 2], "name": "pool5", "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "output_dim": 4096, "input_dim": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "fc6"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "output_dim": 4096, "input_dim": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "fc7"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "output_dim": 487, "input_dim": null, "activation": "softmax", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "fc8"}}], "keras_version": "1.1.1"}