{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution3D", "config": {"trainable": true, "kernel_dim3": 3, "bias": true, "activity_regularizer": null, "name": "conv1", "activation": "relu", "b_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 3, 16, 112, 112], "W_regularizer": null, "init": "glorot_uniform", "kernel_dim2": 3, "nb_filter": 64, "subsample": [1, 1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "th", "kernel_dim1": 3, "border_mode": "same"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "border_mode": "valid", "strides": [1, 2, 2], "name": "pool1", "pool_size": [1, 2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "kernel_dim3": 3, "bias": true, "activity_regularizer": null, "name": "conv2", "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "kernel_dim2": 3, "nb_filter": 128, "subsample": [1, 1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "th", "kernel_dim1": 3, "border_mode": "same"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2, 2], "name": "pool2", "pool_size": [2, 2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "kernel_dim3": 3, "bias": true, "activity_regularizer": null, "name": "conv3a", "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "kernel_dim2": 3, "nb_filter": 256, "subsample": [1, 1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "th", "kernel_dim1": 3, "border_mode": "same"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "kernel_dim3": 3, "bias": true, "activity_regularizer": null, "name": "conv3b", "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "kernel_dim2": 3, "nb_filter": 256, "subsample": [1, 1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "th", "kernel_dim1": 3, "border_mode": "same"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2, 2], "name": "pool3", "pool_size": [2, 2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "kernel_dim3": 3, "bias": true, "activity_regularizer": null, "name": "conv4a", "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "kernel_dim2": 3, "nb_filter": 512, "subsample": [1, 1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "th", "kernel_dim1": 3, "border_mode": "same"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "kernel_dim3": 3, "bias": true, "activity_regularizer": null, "name": "conv4b", "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "kernel_dim2": 3, "nb_filter": 512, "subsample": [1, 1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "th", "kernel_dim1": 3, "border_mode": "same"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2, 2], "name": "pool4", "pool_size": [2, 2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "kernel_dim3": 3, "bias": true, "activity_regularizer": null, "name": "conv5a", "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "kernel_dim2": 3, "nb_filter": 512, "subsample": [1, 1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "th", "kernel_dim1": 3, "border_mode": "same"}}, {"class_name": "Convolution3D", "config": {"trainable": true, "kernel_dim3": 3, "bias": true, "activity_regularizer": null, "name": "conv5b", "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "kernel_dim2": 3, "nb_filter": 512, "subsample": [1, 1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "th", "kernel_dim1": 3, "border_mode": "same"}}, {"class_name": "ZeroPadding3D", "config": {"trainable": true, "name": "zeropadding3d_1", "padding": [0, 1, 1]}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2, 2], "name": "pool5", "pool_size": [2, 2, 2], "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "activity_regularizer": null, "name": "fc6", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "output_dim": 4096, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "activity_regularizer": null, "name": "fc7", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "output_dim": 4096, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "activity_regularizer": null, "name": "fc8", "activation": "softmax", "b_regularizer": null, "W_regularizer": null, "output_dim": 487, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "W_constraint": null}}]}